nc: 80
scales:
  T: [0.33, 0.25, 1024]

# Tracking metadata consumed by the VisDrone tracking training/export scripts.
track:
  id_embedding_dim: 128
  id_loss_weight: 0.25
  pair_gap: 3
  temporal_consistency_weight: 0.05
  external_pretrained: false

backbone:
  - [-1, 1, SimpleStem, [128, 3]]
  - [-1, 3, VSSBlock, [128]]
  - [-1, 1, VisionClueMerge, [256]]
  - [-1, 3, VSSBlock, [256]]
  - [-1, 1, VisionClueMerge, [512]]
  - [-1, 9, VSSBlock, [512]]
  - [-1, 1, VisionClueMerge, [1024]]
  - [-1, 3, VSSBlock, [1024]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024]]

  - [[14, 17, 20], 1, Detect, [nc]]
