nc: 80  # number of classes
scales:   # [depth, width, max_channels]
  T: [0.33, 0.25, 1024]  # Mamba-YOLO-T-SOD summary target: low-overhead P2 small-object branch


# Mamba-YOLO backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]       # 0-P2/4
  - [-1, 3, VSSBlock, [128]]            # 1-P2/4
  - [-1, 1, VisionClueMerge, [256]]     # 2-P3/8
  - [-1, 3, VSSBlock, [256]]            # 3-P3/8
  - [-1, 1, VisionClueMerge, [512]]     # 4-P4/16
  - [-1, 9, VSSBlock, [512]]            # 5-P4/16
  - [-1, 1, VisionClueMerge, [1024]]    # 6-P5/32
  - [-1, 3, VSSBlock, [1024]]           # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]            # 8-P5/32

# Small-object state transfer PAFPN
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]           # cat backbone P4
  - [-1, 3, XSSBlock, [512]]            # 11-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]           # cat backbone P3
  - [-1, 3, XSSBlock, [256]]            # 14-P3/8

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]           # cat backbone P2
  - [-1, 1, SmallObjectStateGate, [96]]  # 17-P2/4, gated CNN detail + Mamba neck state

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]          # cat head P3
  - [-1, 3, XSSBlock, [256]]            # 20-P3/8

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]          # cat head P4
  - [-1, 3, XSSBlock, [512]]            # 23-P4/16

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]           # cat backbone P5
  - [-1, 3, XSSBlock, [1024]]           # 26-P5/32

  - [[17, 20, 23, 26], 1, LightP2Detect, [nc]] # Detect(P2, P3, P4, P5), lightweight P2 towers
