# Mamba-YOLO-T with YOLOV-style temporal feature aggregation (Detect_VID head)
# Drop-in replacement for Mamba-YOLO-T.yaml when training on video clip data.
# Detect_VID args: [nc, topk, conf_thr, num_ref_frames]

nc: 10  # VisDrone-VID classes
scales:
  T: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, SimpleStem, [128, 3]]
  - [-1, 3, VSSBlock, [128]]
  - [-1, 1, VisionClueMerge, [256]]
  - [-1, 3, VSSBlock, [256]]
  - [-1, 1, VisionClueMerge, [512]]
  - [-1, 9, VSSBlock, [512]]
  - [-1, 1, VisionClueMerge, [1024]]
  - [-1, 3, VSSBlock, [1024]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024]]

  - [[14, 17, 20], 1, Detect_VID, [nc, 750, 0.001, 4]]  # Detect_VID(P3,P4,P5)
